In [1]:
import pandas as pd
import numpy as np

In [2]:
supliers = pd.read_csv('d:/Data_Analysis/course-files/northwind-mongo-master/suppliers.csv', usecols=['SupplierID','CompanyName','Country'])
supliers.head()

   SupplierID                         CompanyName Country
0           1                      Exotic Liquids      UK
1           2          New Orleans Cajun Delights     USA
2           3           Grandma Kelly's Homestead     USA
3           4                       Tokyo Traders   Japan
4           5  Cooperativa de Quesos 'Las Cabras'   Spain

In [3]:
customers = pd.read_csv('d:/Data_Analysis/course-files/northwind-mongo-master/customers.csv', usecols=['CustomerID','CompanyName','Country'])
customers.head()

  CustomerID                         CompanyName  Country
0      ALFKI                 Alfreds Futterkiste  Germany
1      ANATR  Ana Trujillo Emparedados y helados   Mexico
2      ANTON            Antonio Moreno Taquer?­a   Mexico
3      AROUT                     Around the Horn       UK
4      BERGS                 Berglunds snabbk?¶p   Sweden

In [4]:
len(supliers)

29

In [5]:
len(customers)

91

In [6]:
supliers.append(customers)

    SupplierID                         CompanyName  Country CustomerID
0          1.0                      Exotic Liquids       UK        NaN
1          2.0          New Orleans Cajun Delights      USA        NaN
2          3.0           Grandma Kelly's Homestead      USA        NaN
3          4.0                       Tokyo Traders    Japan        NaN
4          5.0  Cooperativa de Quesos 'Las Cabras'    Spain        NaN
..         ...                                 ...      ...        ...
86         NaN                      Wartian Herkku  Finland      WARTH
87         NaN              Wellington Importadora   Brazil      WELLI
88         NaN                White Clover Markets      USA      WHITC
89         NaN                         Wilman Kala  Finland      WILMK
90         NaN                      Wolski  Zajazd   Poland      WOLZA

[120 rows x 4 columns]

In [9]:
df_appended = supliers.append(customers, ignore_index=True)

In [10]:
len(df_appended)

120

In [11]:
df_appended.head(40)

    SupplierID                             CompanyName      Country CustomerID
0          1.0                          Exotic Liquids           UK        NaN
1          2.0              New Orleans Cajun Delights          USA        NaN
2          3.0               Grandma Kelly's Homestead          USA        NaN
3          4.0                           Tokyo Traders        Japan        NaN
4          5.0      Cooperativa de Quesos 'Las Cabras'        Spain        NaN
5          6.0                                Mayumi's        Japan        NaN
6          7.0                            Pavlova Ltd.    Australia        NaN
7          8.0                 Specialty Biscuits Ltd.           UK        NaN
8          9.0                        PB Knäckebröd AB       Sweden        NaN
9         10.0               Refrescos Americanas LTDA       Brazil        NaN
10        11.0             Heli Süßwaren GmbH & Co. KG      Germany        NaN
11        12.0       Plutzer Lebensmittelgroßmärkte AG      Germany        NaN
12        13.0  Nord-Ost-Fisch Handelsgesellschaft mbH      Germany        NaN
13        14.0                 Formaggi Fortini s.r.l.        Italy        NaN
14        15.0                         Norske Meierier       Norway        NaN
15        16.0                       Bigfoot Breweries          USA        NaN
16        17.0                       Svensk Sjöföda AB       Sweden        NaN
17        18.0              Aux joyeux ecclésiastiques       France        NaN
18        19.0             New England Seafood Cannery          USA        NaN
19        20.0                            Leka Trading    Singapore        NaN
20        21.0                              Lyngbysild      Denmark        NaN
21        22.0                     Zaanse Snoepfabriek  Netherlands        NaN
22        23.0                               Karkki Oy      Finland        NaN
23        24.0                              G'day Mate    Australia        NaN
24        25.0                               Ma Maison       Canada        NaN
25        26.0                    Pasta Buttini s.r.l.        Italy        NaN
26        27.0                      Escargots Nouveaux       France        NaN
27        28.0                            Gai pâturage       France        NaN
28        29.0                        Forêts d'érables       Canada        NaN
29         NaN                     Alfreds Futterkiste      Germany      ALFKI
30         NaN      Ana Trujillo Emparedados y helados       Mexico      ANATR
31         NaN                Antonio Moreno Taquer?­a       Mexico      ANTON
32         NaN                         Around the Horn           UK      AROUT
33         NaN                     Berglunds snabbk?¶p       Sweden      BERGS
34         NaN                 Blauer See Delikatessen      Germany      BLAUS
35         NaN               Blondesddsl p?¨re et fils       France      BLONP
36         NaN              B??lido Comidas preparadas        Spain      BOLID
37         NaN                                Bon app'       France      BONAP
38         NaN                   Bottom-Dollar Markets       Canada      BOTTM
39         NaN                           B's Beverages           UK      BSBEV

In [23]:
suppliers2 = supliers.copy()
customers2 = customers.copy()

In [24]:
suppliers2.rename({'SupplierID':'CustomerID'}, axis='columns',inplace=True)

In [25]:
suppliers2.head()

   CustomerID                         CompanyName Country
0           1                      Exotic Liquids      UK
1           2          New Orleans Cajun Delights     USA
2           3           Grandma Kelly's Homestead     USA
3           4                       Tokyo Traders   Japan
4           5  Cooperativa de Quesos 'Las Cabras'   Spain

In [28]:
suppliers2.append(customers2)[25:35]

   CustomerID                         CompanyName  Country
25         26                Pasta Buttini s.r.l.    Italy
26         27                  Escargots Nouveaux   France
27         28                        Gai pâturage   France
28         29                    Forêts d'érables   Canada
0       ALFKI                 Alfreds Futterkiste  Germany
1       ANATR  Ana Trujillo Emparedados y helados   Mexico
2       ANTON            Antonio Moreno Taquer?­a   Mexico
3       AROUT                     Around the Horn       UK
4       BERGS                 Berglunds snabbk?¶p   Sweden
5       BLAUS             Blauer See Delikatessen  Germany

In [38]:
df_conctenated = pd.concat(objs=[suppliers2,customers], ignore_index=True, )

In [39]:
df_conctenated[25:35]

   CustomerID                         CompanyName  Country
25         26                Pasta Buttini s.r.l.    Italy
26         27                  Escargots Nouveaux   France
27         28                        Gai pâturage   France
28         29                    Forêts d'érables   Canada
29      ALFKI                 Alfreds Futterkiste  Germany
30      ANATR  Ana Trujillo Emparedados y helados   Mexico
31      ANTON            Antonio Moreno Taquer?­a   Mexico
32      AROUT                     Around the Horn       UK
33      BERGS                 Berglunds snabbk?¶p   Sweden
34      BLAUS             Blauer See Delikatessen  Germany

# Zadanie

In [40]:
mrbean = pd.read_csv('d:/Data_Analysis/course-files/mrbean_facebook_statuses_join.csv', usecols=['status_message_mrbean','status_type','num_likes'])

In [41]:
nasa = pd.read_csv('d:/Data_Analysis/course-files/nasa_facebook_statuses_join.csv',usecols=['status_message_nasa','status_type','num_likes'])

In [43]:
mrbean.head()

                               status_message_mrbean status_type  num_likes
0  It's time for Mr Bean and Teddy to get ready f...       video      16079
1                                                NaN       photo     114008
2                                                NaN       photo     218579
3  Mr Bean is ready to do some shopping but bewar...       video      20338
4                                                NaN       photo     215591

In [44]:
nasa.head()

                                 status_message_nasa status_type  num_likes
0  This morning, the #RockOn mission with student...       photo       5142
1  Pluto's largest moon, Charon, is home to an un...       photo      19074
2  Our Restore-L mission is an endeavor to launch...       photo       7551
3  A new dark vortex was discovered in the atmosp...       photo      24359
4                                                NaN       video       2731

In [51]:
fb = mrbean.append(nasa, sort=True, ignore_index=True)

In [52]:
fb.head()

,num_likes,status_message_mrbean,status_message_nasa,status_type
0,16079,It's time for Mr Bean and Teddy to get ready f...,NaN,video
1,114008,NaN,NaN,photo
2,218579,NaN,NaN,photo
3,20338,Mr Bean is ready to do some shopping but bewar...,NaN,video
4,215591,NaN,NaN,photo

In [55]:
fb.loc[0].to_frame().transpose()

,num_likes,status_message_mrbean,status_message_nasa,status_type
0,16079,It's time for Mr Bean and Teddy to get ready f...,NaN,video

In [58]:
mrbean.rename({'status_message_mrbean':'status_message'}, inplace=True, axis='columns')

In [59]:
mrbean.head()

                                      status_message status_type  num_likes
0  It's time for Mr Bean and Teddy to get ready f...       video      16079
1                                                NaN       photo     114008
2                                                NaN       photo     218579
3  Mr Bean is ready to do some shopping but bewar...       video      20338
4                                                NaN       photo     215591

In [60]:
nasa.rename({'status_message_nasa':'status_message'}, inplace=True, axis='columns')

In [61]:
nasa.head()

                                      status_message status_type  num_likes
0  This morning, the #RockOn mission with student...       photo       5142
1  Pluto's largest moon, Charon, is home to an un...       photo      19074
2  Our Restore-L mission is an endeavor to launch...       photo       7551
3  A new dark vortex was discovered in the atmosp...       photo      24359
4                                                NaN       video       2731

In [62]:
fb = mrbean.append(nasa, ignore_index=True, sort=True)

In [63]:
fb.head()

   num_likes                                     status_message status_type
0      16079  It's time for Mr Bean and Teddy to get ready f...       video
1     114008                                                NaN       photo
2     218579                                                NaN       photo
3      20338  Mr Bean is ready to do some shopping but bewar...       video
4     215591                                                NaN       photo

In [ ]:
fbc = fbc.c